# Cursor Extensions Manifest
# See README "Cursor Extensions" section for full documentation.
#
# List installed:  cursor --list-extensions
# Overwrite this file:  cursor --list-extensions > cursor/extensions.txt  (from repo root)
#
# Install all (PowerShell, from repo root):
#   Get-Content cursor\extensions.txt | Where-Object { $_ -notmatch '^#' -and $_ -match '\S' } | ForEach-Object { cursor --install-extension $_ }
#
# Install all (bash/zsh, from repo root):
#   grep -v '^#' cursor/extensions.txt | grep -v '^[[:space:]]*$' | while read -r ext; do cursor --install-extension "$ext"; done
#
# Lines starting with # are comments and ignored during sync.
#
# ─── Required (guidelines + settings) ───────────────────────────────────────
EditorConfig.EditorConfig
esbenp.prettier-vscode
dbaeumer.vscode-eslint
bradlc.vscode-tailwindcss
ms-python.black-formatter
#
# ─── Recommended for MD stack ───────────────────────────────────────────────
usernamehw.errorlens
formulahendry.auto-rename-tag
dsznajder.es7-react-js-snippets
charliermarsh.ruff
ms-python.vscode-pylance
hashicorp.terraform
mikestead.dotenv
christian-kohler.path-intellisense
github.vscode-github-actions
#
# ─── NetSuite (if you do SuiteScript) ─────────────────────────────────────────
ericbirdsall.SuiteSnippets
nsupload-org.netsuite-upload
#
# ─── Tauri (if you do desktop apps) ──────────────────────────────────────────
rust-lang.rust-analyzer
tauri-apps.tauri-vscode
#
# ─── Prisma (if you use Prisma for PostgreSQL) ──────────────────────────────
Prisma.prisma
#
# ─── Optional ──────────────────────────────────────────────────────────────
yzhang.markdown-all-in-one
aaron-bond.better-comments
streetsidesoftware.code-spell-checker
rangav.vscode-thunder-client
ms-playwright.playwright
#
# ─── Already installed (from cursor --list-extensions) ────────────────────────
anysphere.cursorpyright
anysphere.remote-wsl
cweijan.vscode-office
eamodio.gitlens
johnpapa.vscode-peacock
ms-python.debugpy
ms-python.python
ms-vscode.powershell
tomoki1207.pdf
