# Cursor Extensions Manifest
# See README "Cursor and VS Code IDE settings" and cursor/EXTENSIONS.md for full documentation.
#
# List installed:  cursor --list-extensions
# Curated for:    Python + Django/Jinja, Node/React/TS (Prettier + ESLint + Tailwind + Vite),
#                 remote (WSL/SSH/Containers), Terraform + GitHub Actions, Windows/PowerShell,
#                 NetSuite when needed, optional desktop (Tauri) and DB (Prisma).
#
# Install all (PowerShell, from repo root):
#   Get-Content cursor\extensions.txt | Where-Object { $_ -notmatch '^#' -and $_ -match '\S' } | ForEach-Object { cursor --install-extension $_ }
#
# Install all (bash/zsh, from repo root):
#   grep -v '^#' cursor/extensions.txt | grep -v '^[[:space:]]*$' | while read -r ext; do cursor --install-extension "$ext"; done
#
# Lines starting with # are comments and ignored during sync.
#
# ─── Core (matches cursor/settings.json) ─────────────────────────────────────
EditorConfig.EditorConfig
esbenp.prettier-vscode
dbaeumer.vscode-eslint
bradlc.vscode-tailwindcss
ms-python.black-formatter
johnpapa.vscode-peacock
#
# ─── Python ──────────────────────────────────────────────────────────────────
anysphere.cursorpyright
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
njpwerner.autodocstring
donjayamanne.python-environment-manager
charliermarsh.ruff
kevinrose.vsc-python-indent
batisteo.vscode-django
wholroyd.jinja
#
# ─── Remote / WSL ────────────────────────────────────────────────────────────
anysphere.remote-wsl
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-containers
ms-vscode.remote-explorer
ms-vscode.remote-server
#
# ─── Web / React / TS ───────────────────────────────────────────────────────
usernamehw.errorlens
formulahendry.auto-rename-tag
dsznajder.es7-react-js-snippets
mikestead.dotenv
christian-kohler.path-intellisense
#
# ─── Infra & CI ──────────────────────────────────────────────────────────────
hashicorp.terraform
github.vscode-github-actions
#
# ─── NetSuite (if you do SuiteScript) ─────────────────────────────────────────
ericbirdsall.SuiteSnippets
nsupload-org.netsuite-upload
#
# ─── Tauri (if you do desktop apps) ──────────────────────────────────────────
rust-lang.rust-analyzer
tauri-apps.tauri-vscode
#
# ─── Prisma ──────────────────────────────────────────────────────────────────
Prisma.prisma
#
# ─── Optional quality-of-life ────────────────────────────────────────────────
yzhang.markdown-all-in-one
aaron-bond.better-comments
streetsidesoftware.code-spell-checker
rangav.vscode-thunder-client
ms-playwright.playwright
mechatroner.rainbow-csv
ms-vscode.powershell
cweijan.vscode-office
eamodio.gitlens

ukoloff.win-ca
eriklynd.json-tools
tomoki1207.pdf
visualstudioexptteam.vscodeintellicode
visualstudioexptteam.intellicode-api-usage-examples
